# Exercise Problems

## Part 1

In [1]:
# Importing libraries

import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [2]:
# Importing dataframes

path = r'C:\Users\William Inglish\Instacart Basket Analysis'

ords_prods_merge = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_merged_3.pkl'))

In [3]:
customer = pd.read_csv(os.path.join(path,'02 Data', 'Original Data', 'customers.csv'),index_col = False)

### Verifying and Cleaning New DataFrame

In [4]:
# Checking the new df

customer.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [5]:
# Checking data types

customer.dtypes

user_id          int64
First Name      object
Surnam          object
Gender          object
STATE           object
Age              int64
date_joined     object
n_dependants     int64
fam_status      object
income           int64
dtype: object

In [6]:
# Checking size
customer.shape

(206209, 10)

In [7]:
# Renaming Surnam to Last Name
customer.rename(columns = {'Surnam': 'Last Name'}, inplace = True)

In [8]:
# Renaming n_dependants to Number of dependants
customer.rename(columns = {'n_dependants': 'Number of dependants'}, inplace = True)

In [9]:
# Renaming fam_status to family status
customer.rename(columns = {'fam_status': 'family status'}, inplace = True)

In [10]:
# Renaming STATE to State
customer.rename(columns = {'STATE': 'State'}, inplace = True)

In [12]:
# changing user_id since it is a category
customer['user_id'] = customer['user_id'].astype('str')

In [13]:
customer.dtypes

user_id                 object
First Name              object
Last Name               object
Gender                  object
State                   object
Age                      int64
date_joined             object
Number of dependants     int64
family status           object
income                   int64
dtype: object

In [14]:
#Looking at stats
customer.describe()

                 Age  Number of dependants         income
count  206209.000000         206209.000000  206209.000000
mean       49.501646              1.499823   94632.852548
std        18.480962              1.118433   42473.786988
min        18.000000              0.000000   25903.000000
25%        33.000000              0.000000   59874.000000
50%        49.000000              1.000000   93547.000000
75%        66.000000              3.000000  124244.000000
max        81.000000              3.000000  593901.000000

In [15]:
#Looking for null values in all columns
customer.isnull().sum()

user_id                     0
First Name              11259
Last Name                   0
Gender                      0
State                       0
Age                         0
date_joined                 0
Number of dependants        0
family status               0
income                      0
dtype: int64

In [16]:
#Changing missing values of First Name
Null_name = customer[customer['First Name'].isnull() == True]

Null_name

,user_id,First Name,Last Name,Gender,State,Age,date_joined,Number of dependants,family status,income
53,76659,NaN,Gilbert,Male,Colorado,26,1/1/2017,2,married,41709
73,13738,NaN,Frost,Female,Louisiana,39,1/1/2017,0,single,82518
82,89996,NaN,Dawson,Female,Oregon,52,1/1/2017,3,married,117099
99,96166,NaN,Oconnor,Male,Oklahoma,51,1/1/2017,1,married,155673
105,29778,NaN,Dawson,Female,Utah,63,1/1/2017,3,married,151819
...,...,...,...,...,...,...,...,...,...,...
206038,121317,NaN,Melton,Male,Pennsylvania,28,3/31/2020,3,married,87783
206044,200799,NaN,Copeland,Female,Hawaii,52,4/1/2020,2,married,108488
206090,167394,NaN,Frost,Female,Hawaii,61,4/1/2020,1,married,45275
206162,187532,NaN,Floyd,Female,California,39,4/1/2020,0,single,56325
206171,116898,NaN,Delgado,Female,Colorado,23,4/1/2020,2,married,59222

In [17]:
# Checking for mixed types
for col in customer.columns.tolist():
  weird = (customer[[col]].applymap(type) != customer[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (customer[weird]) > 0:
    print (col, 'mixed')
  else: print(col,'consistent')

user_id consistent
First Name mixed
Last Name consistent
Gender consistent
State consistent
Age consistent
date_joined consistent
Number of dependants consistent
family status consistent
income consistent

In [18]:
# Changing First Name into an object dtype
customer['First Name'] = customer['First Name'].astype('str')

In [21]:
# Verifying for mixed types
for col in customer.columns.tolist():
  weird = (customer[[col]].applymap(type) != customer[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (customer[weird]) > 0:
    print (col, 'mixed')
  else: print(col,'consistent')

user_id consistent
First Name consistent
Last Name consistent
Gender consistent
State consistent
Age consistent
date_joined consistent
Number of dependants consistent
family status consistent
income consistent

In [23]:
# Checking for duplicated data
customer[customer.duplicated()]

Empty DataFrame
Columns: [user_id, First Name, Last Name, Gender, State, Age, date_joined, Number of dependants, family status, income]
Index: []

### Merging DataFrames

In [24]:
#Setting up for merging
ords_prods_merge.shape

(32404859, 24)

In [25]:
ords_prods_merge.dtypes

product_id                   int64
product_name                object
aisle_id                     int64
department_id                int64
prices                     float64
order_id                     int64
user_id                      int64
evaluation_set              object
order_number                 int64
order_day_of_the_week        int64
order_hour_of_day            int64
days_since_prior_order     float64
add_to_cart_order            int64
reordered                    int64
_merge                    category
price_range_loc             object
busiest_days                object
busiest_period_of_day       object
max_order                    int64
loyalty_flag                object
average_price              float64
spending_flag               object
median_prior_order         float64
order_frequency_flag        object
dtype: object

I will use user_id as the key to merge the dataframes. Just need to change the dtype to an object

In [26]:
#Change user_id to an object
ords_prods_merge['user_id'] = ords_prods_merge['user_id'].astype('str')

In [27]:
ords_prods_merge['user_id'].dtype

dtype('O')

In [28]:
# Merging dfs into df_merged

df_merged = ords_prods_merge.merge(customer, on = 'user_id')

In [29]:
#Verifying columns
df_merged.head()

,product_id,product_name,aisle_id,department_id,prices,order_id,user_id,evaluation_set,order_number,order_day_of_the_week,...,order_frequency_flag,First Name,Last Name,Gender,State,Age,date_joined,Number of dependants,family status,income
0,1,Chocolate Sandwich Cookies,61,19,5.8,3139998,138,prior,28,6,...,Frequent customer,Charles,Cox,Male,Minnesota,81,8/1/2019,1,married,49620
1,1,Chocolate Sandwich Cookies,61,19,5.8,1977647,138,prior,30,6,...,Frequent customer,Charles,Cox,Male,Minnesota,81,8/1/2019,1,married,49620
2,907,Premium Sliced Bacon,106,12,20.0,3160996,138,prior,1,5,...,Frequent customer,Charles,Cox,Male,Minnesota,81,8/1/2019,1,married,49620
3,907,Premium Sliced Bacon,106,12,20.0,2254091,138,prior,10,5,...,Frequent customer,Charles,Cox,Male,Minnesota,81,8/1/2019,1,married,49620
4,1000,Apricots,18,10,12.9,505689,138,prior,9,6,...,Frequent customer,Charles,Cox,Male,Minnesota,81,8/1/2019,1,married,49620

In [30]:
#Verifying size
df_merged.shape

(32404859, 33)

In [32]:
df_merged.columns

Index(['product_id', 'product_name', 'aisle_id', 'department_id', 'prices',
       'order_id', 'user_id', 'evaluation_set', 'order_number',
       'order_day_of_the_week', 'order_hour_of_day', 'days_since_prior_order',
       'add_to_cart_order', 'reordered', '_merge', 'price_range_loc',
       'busiest_days', 'busiest_period_of_day', 'max_order', 'loyalty_flag',
       'average_price', 'spending_flag', 'median_prior_order',
       'order_frequency_flag', 'First Name', 'Last Name', 'Gender', 'State',
       'Age', 'date_joined', 'Number of dependants', 'family status',
       'income'],
      dtype='object')

In [35]:
#Changing column names to be uniform
df_merged.rename(columns = {'First Name' : 'first_name', 'Last Name' : 'last_name', 'Gender' : 'gender', 'STATE' : 'state', 'Age' : 'age', 'Number of dependants' : 'number_of_dependants', 'family status' : 'marital_status'}, inplace = True)

In [36]:
df_merged.columns

Index(['product_id', 'product_name', 'aisle_id', 'department_id', 'prices',
       'order_id', 'user_id', 'evaluation_set', 'order_number',
       'order_day_of_the_week', 'order_hour_of_day', 'days_since_prior_order',
       'add_to_cart_order', 'reordered', '_merge', 'price_range_loc',
       'busiest_days', 'busiest_period_of_day', 'max_order', 'loyalty_flag',
       'average_price', 'spending_flag', 'median_prior_order',
       'order_frequency_flag', 'first_name', 'last_name', 'gender', 'State',
       'age', 'date_joined', 'number_of_dependants', 'marital_status',
       'income'],
      dtype='object')

I will export this now since all dataframes are cleaned and condensed

In [38]:
#Exporting dataframe
df_merged.to_pickle(os.path.join(path, '02 Data', 'Prepared Data','customer_merge.pkl'))